In [33]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import scipy as scpy
import matplotlib.pyplot as plt
import seaborn as sns

In [34]:
engine = create_engine('mysql+pymysql://root:Bhavi%40123@localhost:3306/CafeSales')

In [35]:
def run_query(query):
    with engine.connect() as conn:
        return pd.read_sql(query, conn)

In [36]:
run_query('SELECT * FROM sales LIMIT 5;')

,Item,Quantity,Price_per_unit,Total_spent,Payment_method,Location,Trans_date
0,Coffee,2.0,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,Cake,4.0,3.0,12.0,Cash,In-store,2023-05-16
2,Cookie,4.0,1.0,ERROR,Credit Card,In-store,2023-07-19
3,Salad,2.0,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,Coffee,2.0,2.0,4.0,Digital Wallet,In-store,2023-06-11

In [40]:
# Total Sales of each Item :
run_query('''
          SELECT Item, SUM(Total_spent) AS Total_Sales
          FROM sales
          WHERE Item NOT IN ('ERROR','UNKNOWN')
          GROUP BY Item
          ORDER BY Total_Sales DESC;
          ''')

       Item  Total_Sales
0     Salad      17365.0
1  Sandwich      14324.0
2  Smoothie      12724.0
3     Juice      10869.0
4      Cake      10131.0
5    Coffee       7140.0
6       Tea       4883.0
7    Cookie       3227.5

In [43]:
run_query('''
          SELECT Item,Total_spent 
          FROM sales
          WHERE Item IN ('Cake','Tea')
          LIMIT 5;
          ''')

   Item Total_spent
0  Cake        12.0
1  Cake        15.0
2  Cake        12.0
3   Tea     UNKNOWN
4  Cake         9.0

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')

In [ ]:
run_query('''
          
          ''')